syllabus.tex
% Created 2023-10-02 Mon 17:46
% Intended LaTeX compiler: pdflatex
\documentclass[letterpaper,parskip=half]{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{braket}
\input{boilerplate}
\author{Patrick D. Elliott}
\date{\today}
\title{Semantics in Generative Grammar\\\medskip
\large HHU WS 2023/2024}
\hypersetup{
 pdfauthor={Patrick D. Elliott},
 pdftitle={Semantics in Generative Grammar},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.7-pre)}, 
 pdflang={English}}
\usepackage{biblatex}
\addbibresource{../bibliography/master.bib}
\addbibresource{~/repos/bibliography/master.bib}
\begin{document}

\maketitle
\section{Description}
\label{sec:org110496e}

This course is intended as a first `real' introduction to formal semantics in the context of generative linguistics. That is to say, by the end of this course you'll be equipped with the necessary tools to (i) read formal semantics papers, and (ii) write a serious research paper. To get there, we'll be working through the standard graduate semantics text - ``Semantics in Generative Grammar'' \autocite{HeimKratzer1998}, written by two of the most influential researchers in the field: Irene Heim and Angelika Kratzer. Anecdotally, I've often heard scholars refer to this text as the semantics ``bible'', and indeed many of the assumptions implicit in contemporary research can be traced back to this textbook. 

Unlike the course ``introduction to semantics'', which is empirically broad but technically shallow, in this course we'll focus on building an internally coherent analytical framework from the ground up, by focusing on a tightly constrained fragment of English. As a student, you'll be expected to do the weekly reading (i.e., a chapter from \emph{Semantics in Generative Grammar}) and participate in class discussion. There will also be (ungraded) homework exercises taken from the textbook. 

\begin{itemize}
\item Class homepage: \url{https://github.com/patrl/hhu-advanced-sem}
\end{itemize}
\section{Team}
\label{sec:org2415cec}

\begin{itemize}
\item \textbf{Instructor:} Dr. Patrick D. Elliott \texttt{patrick.elliott@hhu.de}; \texttt{https://patrickdelliott.com}
\item \textbf{Secretary:} Tim Marton \texttt{tim.marton@phil.hhu.de}
\end{itemize}
\section{Time and place}
\label{sec:org412b9fd}

\begin{itemize}
\item Class takes place on \textbf{Wednesday} at 12:30-14:00.
\item Class takes place in \textbf{2303.U1.25}
\end{itemize}
\section{Language of instruction}
\label{sec:org07bbfab}

The lectures, as well as the readings for this class will be in \textbf{English}.
\section{Leistungsnachweis}
\label{sec:org5fa566d}

\subsection{BN requirements}
\label{sec:orgb6ad277}

\begin{itemize}
\item Do the weekly reading.
\item Participate in class discussion.
\end{itemize}
\subsection{AP requirements}
\label{sec:org1dfdbbe}

\begin{itemize}
\item Write a squib (i.e., a short research report).
\end{itemize}
\section{Comms}
\label{sec:org0f9e13a}

\subsection{Rocketchat}
\label{sec:org6724780}

Join the rocketchat channel using the following link: \url{https://rocketchat.hhu.de/invite/c8YKhS}. Note that this is \textbf{obligatory}; in an attempt to keep things simple, I'll use this as the main channel of communication for the class, including announcements etc.
\subsection{Office hours}
\label{sec:org8af9629}

I hold office hours at 3-4pm on Wednesdays. You can find me in building 23.21, room 04.73. Please let me know in advance the time that you plan on dropping by, so that I can stagger appointments.
\subsection{Email}
\label{sec:org56d8b04}

For any questions regarding the class, please post in rocketchat, so that others can benefit from the response. For any private queries, you can email me at \texttt{patrick.elliott@hhu.edu}.
\section{Tentative schedule}
\label{sec:org74d2a96}

\begin{itemize}
\item 14 90 minute long lectures.
\end{itemize}

\begin{center}
\begin{tabular}{ll}
date & class\\[0pt]
\hline
Oct 11 & Truth-conditional semantics and the Fregean Program\\[0pt]
Oct 18 & Executing the Fregean program\\[0pt]
Oct 25 & Semantics and syntax\\[0pt]
Nov 1 & NO CLASS\\[0pt]
Nov 8 & Nonverbal predicates, modifiers, definite descriptions\\[0pt]
Nov 15 & Relative clauses, variables, variable binding\\[0pt]
Nov 22 & Quantifiers: their semantic type\\[0pt]
Nov 29 & Quantification and grammar\\[0pt]
Dec 6 & Syntactic and semantic constraints on quantifier movement\\[0pt]
Dec 13 & Bound and referential pronouns and ellipsis\\[0pt]
Dec 20 & Synactic and semantic binding\\[0pt]
 & WINTER BREAK\\[0pt]
Jan 10 & E-type anaphora\\[0pt]
Jan 17 & First steps towards an intensional semantics\\[0pt]
Jan 24 & TBC\\[0pt]
Jan 31 & TBC\\[0pt]
\end{tabular}
\end{center}

\printbibliography
\end{document}